InformationRegisters/LN_МСРНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРНастройки</Name>
			<Comment>Серверные настройки LN_MCP_1C (формат ответа, лимиты токенов, режим execute_code, и т.п.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/LN_МСРОтветы/Ext/Module.bsl
//LN++ Общий модуль LN_МСРОтветы
// Сборка тела HTTP-ответа: успех, ошибка, опционально TOON / JSON-compact / JSON.
// Используется HTTP-сервисом и REST-эндпоинтами /api/{tool}.
//
// Согласование формата:
//   1) явный query-параметр format=...
//   2) заголовок X-MCP-Format
//   3) Accept: application/x-toon -> toon
//   4) дефолт из настроек регистра LN_МСРНастройки (ключ "format_default")
//
// Поддерживается пагинация (page, page_size) и лимит символов (max_chars).
//

#Область ПрограммныйИнтерфейс

// Возвращает структуру успешного ответа MCP-tool с уже сериализованным содержимым.
Функция Успех(Данные, ОтветHTTPСервиса = Неопределено, ПараметрыЗапроса = Неопределено) Экспорт

	Формат = ОпределитьФорматПоЗапросу(ОтветHTTPСервиса, ПараметрыЗапроса);
	Лимит  = ОпределитьЛимитСимволов(ПараметрыЗапроса);

	Если ПараметрыЗапроса <> Неопределено Тогда
		Данные = ПрименитьПагинацию(Данные, ПараметрыЗапроса);
	КонецЕсли;

	Сериализовано = LN_МСРКодирование.ЗакодироватьОтвет(Данные, Формат, Лимит);

	Возврат Новый Структура("ТелоОтвета, ТипКонтента, КодСтатуса, Формат",
		Сериализовано, ТипКонтентаДляФормата(Формат), 200, Формат);

КонецФункции

// Возвращает структуру ошибки MCP-tool. КодСтатуса по умолчанию 400 (валидация).
Функция Ошибка(Сообщение, КодСтатуса = 400, КодОшибки = "tool_error", ОтветHTTPСервиса = Неопределено, ПараметрыЗапроса = Неопределено) Экспорт

	Формат = ОпределитьФорматПоЗапросу(ОтветHTTPСервиса, ПараметрыЗапроса);

	Полезная = Новый Структура;
	Полезная.Вставить("error", КодОшибки);
	Полезная.Вставить("message", Сообщение);

	Сериализовано = LN_МСРКодирование.ЗакодироватьОтвет(Полезная, Формат);

	Возврат Новый Структура("ТелоОтвета, ТипКонтента, КодСтатуса, Формат",
		Сериализовано, ТипКонтентаДляФормата(Формат), КодСтатуса, Формат);

КонецФункции

// Заполняет ОтветHTTPСервиса из результата Успех()/Ошибка().
Процедура ОтправитьОтвет(ОтветHTTPСервиса, СтруктураОтвета) Экспорт

	ОтветHTTPСервиса.КодСостояния = СтруктураОтвета.КодСтатуса;
	ОтветHTTPСервиса.Заголовки["Content-Type"] = СтруктураОтвета.ТипКонтента + "; charset=utf-8";
	ОтветHTTPСервиса.Заголовки["X-MCP-Format"] = СтруктураОтвета.Формат;
	ОтветHTTPСервиса.УстановитьТелоИзСтроки(СтруктураОтвета.ТелоОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФорматПоЗапросу(ОтветHTTPСервиса, ПараметрыЗапроса)

	Если ПараметрыЗапроса <> Неопределено И ПараметрыЗапроса.Свойство("format") И ЗначениеЗаполнено(ПараметрыЗапроса.format) Тогда
		Возврат LN_МСРКодирование.СогласоватьФормат(ПараметрыЗапроса.format);
	КонецЕсли;
	Если ОтветHTTPСервиса <> Неопределено И ТипЗнч(ОтветHTTPСервиса) = Тип("ОтветHTTPСервиса") Тогда
		// note: ОтветHTTPСервиса не несёт заголовков запроса; согласование по Accept делает вызывающий код
	КонецЕсли;
	Возврат ДефолтныйФормат();

КонецФункции

Функция ОпределитьЛимитСимволов(ПараметрыЗапроса)

	Если ПараметрыЗапроса = Неопределено Тогда
		Возврат ДефолтныйЛимитСимволов();
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("max_chars") И ЗначениеЗаполнено(ПараметрыЗапроса.max_chars) Тогда
		Попытка
			Возврат Число(ПараметрыЗапроса.max_chars);
		Исключение
			Возврат ДефолтныйЛимитСимволов();
		КонецПопытки;
	КонецЕсли;
	Возврат ДефолтныйЛимитСимволов();

КонецФункции

Функция ДефолтныйФормат()

	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.LN_МСРНастройки ГДЕ Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ", "format_default");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат LN_МСРКодирование.СогласоватьФормат(Выборка.Значение);
	КонецЕсли;
	Возврат "json";

КонецФункции

Функция ДефолтныйЛимитСимволов()

	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.LN_МСРНастройки ГДЕ Ключ = &Ключ");
	Запрос.УстановитьПараметр("Ключ", "max_chars_default");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Попытка
			Возврат Число(Выборка.Значение);
		Исключение
			Возврат 0;
		КонецПопытки;
	КонецЕсли;
	Возврат 0;

КонецФункции

Функция ТипКонтентаДляФормата(Формат)

	Если Формат = "toon" Тогда
		Возврат "application/x-toon";
	КонецЕсли;
	Возврат "application/json";

КонецФункции

Функция ПрименитьПагинацию(Данные, ПараметрыЗапроса)

	// Пагинация применяется только к коллекциям, имеющим Количество().
	Если ТипЗнч(Данные) <> Тип("Массив") И ТипЗнч(Данные) <> Тип("ТаблицаЗначений") Тогда
		Возврат Данные;
	КонецЕсли;
	page = 1;
	page_size = 0;
	Если ПараметрыЗапроса.Свойство("page") И ЗначениеЗаполнено(ПараметрыЗапроса.page) Тогда
		Попытка page = Число(ПараметрыЗапроса.page); Исключение page = 1; КонецПопытки;
	КонецЕсли;
	Если ПараметрыЗапроса.Свойство("page_size") И ЗначениеЗаполнено(ПараметрыЗапроса.page_size) Тогда
		Попытка page_size = Число(ПараметрыЗапроса.page_size); Исключение page_size = 0; КонецПопытки;
	КонецЕсли;
	Если page_size <= 0 Тогда
		Возврат Данные;
	КонецЕсли;
	НачИндекс = (page - 1) * page_size;
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Результат = Новый Массив;
		Для Инд = НачИндекс По МинимумДвух(НачИндекс + page_size - 1, Данные.ВГраница()) Цикл
			Результат.Добавить(Данные[Инд]);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	// ТаблицаЗначений
	Результат = Данные.СкопироватьКолонки();
	Для Инд = НачИндекс По МинимумДвух(НачИндекс + page_size - 1, Данные.Количество() - 1) Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Данные[Инд]);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция МинимумДвух(А, Б)
	Возврат ?(А < Б, А, Б);
КонецФункции

#КонецОбласти
//LN--
